---
type: ToposolidType
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# ToposolidType

`Autodesk.Revit.DB.ToposolidType` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetContourSetting | 2024 | `public ContourSetting GetContourSetting ()` |
| Property | Parameter | — | `` |